Repository: C0C41N/blockchain-sdk-swift
Catalog: BlockchainSdk/Common/Localizations/*.lproj/Localizable.strings
Languages: fr

# cardano_low_ada
source: Sent amount and change cannot be less than 1 ADA
fr: Le montant envoyé et la change ne peuvent pas être inférieurs à 1 ADA

# cardano_missing_unspents
source: Missing unspents
fr: Il n'y a pas de montants non dépensés

# common_build_tx_error
source: Failed to build transaction
fr: Échec de création de la transaction

# common_estimate_tx_size_error
source: Failed to calculate transaction size
fr: Échec de calcul de la taille de la transaction

# common_fee_error
source: Failed to get fee
fr: Échec de réception des commissions

# common_parse_network_response_error
source: Failed to parse network response
fr: Échec d'analyse de la réponse du réseau

# common_send_tx_error
source: Failed to send transaction
fr: Échec d'envoi de la transaction

# eth_balance_parse_error
source: Failed to parse the balance
fr: Échec d'analyse du solde

# eth_tx_count_parse_error
source: Failed to parse tx count
fr: Échec d'analyse du compteur de transactions

# no_account_bnb
source: To create account send funds to this address
fr: Pour créer un compte, envoyez des fonds monétaires à cette adresse

# no_account_generic
source: Load %@+ %@ to create account
fr: Pour créer un compte, téléchargez %1$@+ %2$@

# send_error_dust_amount_format
source: Minimum amount is %@
fr: Le montant minimal est de %@

# send_error_dust_change_format
source: Minimum change is %@
fr: Le monnaie minimal est de %@

# send_error_invalid_fee_value
source: Invalid Fee
fr: Commission non valide

# send_error_no_target_account
source: Target account is not created. Amount to send should be %@ + fee or more
fr: Le compte cible n'a pas été créé. Le montant à envoyer doit être de %@ + commissions ou plus

# send_validation_amount_exceeds_balance
source: Amount exceeds balance
fr: Le montant dépasse le solde

# send_validation_invalid_amount
source: Invalid amount
fr: Somme incorrecte

# send_validation_invalid_fee
source: Fee exceeds balance
fr: Les commissions dépassent le solde

# send_validation_invalid_total
source: Total amount exceeds balance
fr: Le total dépasse le solde

# xlm_empty_response_error
source: Empty response
fr: Réponse vide

# xlm_latest_ledger_error
source: Couldn't find the latest ledger
fr: Le dernier livre n'a pas été trouvé

# xlm_requires_memo_error
source: Requires memo
fr: Mémo est requis

# xrp_load_account_error
source: Failed to load account info
fr: Échec de téléchargement des informations sur le compte

# xrp_load_reserve_error
source: Failed to load reserve
fr: Échec de téléchargement de la réserve

# xrp_load_unconfirmed_error
source: Failed to load unconfirmed balance
fr: Échec de téléchargement du solde non confirmé

# xrp_missing_reserve_error
source: Missing reserve
fr: Il n'y a pas de réserve

# xtz_withdrawal_message_ignore
source: No, send all
fr: Non, envoyer toute la somme

# xtz_withdrawal_message_reduce
source: Reduce by %@ XTZ
fr: Réduire de %@ XTZ

# xtz_withdrawal_message_warning
source: To avoid paying an increased commission the next time you top up your wallet, reduce the amount by %@ XTZ
fr: Pour ne pas payer une commission élevée la prochaine fois que vous rechargez votre portefeuille, veuillez réduire le montant de %@ XTZ
